package org.spbelect;

import java.util.List;

public class SignatureResearch {

    public static String[] regionsToDistrict = new String[]{
            "Адыгея(Республика Адыгея)", "1",
            "Алтай(Республика Алтай)", "2",
            "Алтайский край", "39 40 41 42",
            "Амурская область", "71",
            "Архангельская область", "72 73",
            "Астраханская область", "74",
            "Башкортостан(Республика Башкортостан)", "3 4 5 6 7 8",
            "Белгородская область", "75 76",
            "Брянская область", "77 78",
            "Бурятия(Республика Бурятия)", "9",
            "Владимирская область", "79 80",
            "Волгоградская область", "81 82 83 84",
            "Вологодская область", "85 86",
            "Воронежская область", "87 88 89 90",
            "Дагестан(Республика Дагестан)", "10 11 12",
            "Еврейская автономная область", "220",
            "Забайкальский край", "43 44",
            "Ивановская область", "91 92",
            "Ингушетия(Республика Ингушетия)", "13",
            "Иркутская область", "93 94 95 96",
            "Кабардино-Балкария(Кабардино-Балкарская Республика)", "14",
            "Калининградская область", "97 98",
            "Калмыкия(Республика Калмыкия)", "15",
            "Калужская область", "99 100",
            "Камчатский край", "45",
            "Карачаево-Черкесия(Карачаево-Черкесская Республика)", "16",
            "Карелия(Республика Карелия)", "17",
            "Кемеровская область", "101 102 103 104",
            "Кировская область", "105 106",
            "Коми(Республика Коми)", "18",
            "Костромская область", "107",
            "Краснодарский край(Кубань)", "46 47 48 49 50 51 52 53",
            "Красноярский край", "54 55 56 57",
            "Крым(Республика Крым)", "19 20 21",
            "Курганская область", "108",
            "Курская область", "109 110",
            "Ленинградская область", "111 112 113",
            "Липецкая область", "114 115",
            "Магаданская область", "116",
            "Марий Эл(Республика Марий Эл)", "22",
            "Мордовия(Республика Мордовия)", "23",
            "Москва", "196 197 198 199 200 201 202 203 204 205 206 207 208 209 210",
            "Московская область", "117 118 119 120 121 122 123 124 125 126 127",
            "Мурманская область", "128",
            "Ненецкий автономный округ", "221",
            "Нижегородская область", "129 130 131 132 133",
            "Новгородская область", "134",
            "Новосибирская область", "135 136 137 138",
            "Омская область", "139 140 141",
            "Оренбургская область", "142 143 144",
            "Орловская область", "145",
            "Пензенская область", "146 147",
            "Пермский край", "58 59 60 61",
            "Приморский край", "62 63 64",
            "Псковская область", "148",
            "Ростовская область", "149 150 151 152 153 154 155",
            "Рязанская область", "156 157",
            "Самарская область", "158 159 160 161 162",
            "Санкт-Петербург", "211 212 213 214 215 216 217 218",
            "Саратовская область", "163 164 165 166",
            "Саха(Республика Саха(Якутия))", "24",
            "Сахалинская область", "167",
            "Свердловская область", "168 169 170 171 172 173 174",
            "Севастополь", "219",
            "Северная Осетия(Республика Северная Осетия — Алания)", "25",
            "Смоленская область", "175 176",
            "Ставропольский край", "65 66 67 68",
            "Тамбовская область", "177 178",
            "Татарстан(Республика Татарстан)", "26 27 28 29 30 31",
            "Тверская область", "179 180",
            "Томская область", "181 182",
            "Тульская область", "183 184",
            "Тыва(Республика Тыва)", "32",
            "Тюменская область", "185 186",
            "Удмуртия(Удмуртская Республика)", "33 34",
            "Ульяновская область", "187 188",
            "Хабаровский край", "69 70",
            "Хакасия(Республика Хакасия)", "35",
            "Ханты-Мансийский автономный округ — Югра", "222 223",
            "Челябинская область", "189 190 191 192 193",
            "Чечня(Чеченская Республика)", "36",
            "Чувашия(Чувашская Республика)", "37 38",
            "Чукотка(Чукотский автономный округ)", "224",
            "Ямало-Ненецкий автономный округ", "225",
            "Ярославская область", "194 195"
    };

    public static void main(String[] args) throws Exception {
        /*
         0 - КОММУНИСТЫ РОССИИ
         1 - ПАРТИЯ РОСТА
         2 - ЯБЛОКО
         Исходные данные: http://www.vybory.izbirkom.ru/region/region/izbirkom?action=show&root=1&tvd=100100067795854&vrn=100100067795849&region=0&global=1&sub_region=0&prver=0&pronetvd=0&vibid=100100067795854&type=233
         */
        List<String> input = FindMatch2015.getLines("spbuik/duma2016.txt");
        int[][] data = new int[3][225];
        for (int i = 0; i < input.size(); i++) {
            String[] s = input.get(i).split(" ");
            data[i / 225][i % 225] = Integer.parseInt(s[1]);
        }
        int[][] stat = new int[3][85];
        for (int i = 0; i < 3; i++) {
            for (int j = 0; j < 85; j++) {
                String[] numbers = regionsToDistrict[2 * j + 1].split(" ");
                for (String number : numbers) {
                    stat[i][j] += data[i][Integer.parseInt(number) - 1];
                }
            }
        }
        int maxConversion = 12;
        System.out.println("Количество голосов по регионам:");
        int[][] estimate = new int[3][maxConversion];
        for (int i = 0; i < 3; i++) {
            int sum = 0;
            for (int j = 0; j < 85; j++) {
                int v = stat[i][j];
                System.out.print(v + " ");
                sum += v;
                for (int k = 1; k < maxConversion; k++) {
                    estimate[i][k] += Math.min(2500, v / k);
                }
            }
            System.out.println();
            System.out.println(sum);
        }

        System.out.println("Количество подписей при конверсии от 1 до " + (maxConversion -1) + " голосов на подпись:");
        for (int i = 0; i < 3; i++) {
            for (int j = 1; j < maxConversion; j++) {
                int v = estimate[i][j];
                System.out.print(v + " ");
            }
            System.out.println();
        }
    }
}


